<?php
    // 循环结构语句

    //案例：求1+2+3+4=?

    // 	while 循环语句
    /*
        while(循环条件)
        {
            //循环体
        }
    */
    $i = 0;
    $sum = 0;
    while($i<=4)
    {
        $sum += $i; //等价于 $sum = $sum + $i;
        $i++;
    }
    echo $sum."<br>";

    // 	do … while 循环语句 : 不管循环条件是否成立，循环体至少要执行一次！
    /*
        do
        {
            //循环体
        }while(循环条件);
    */

    $i = 0;
    $sum = 0;
    do
    {
        $sum += $i;
        $i++;
    }while($i<=4);

    echo $sum."<br>";

    // 	for 循环语句
    /*
        for关键字后面()包括了三部分：初始化表达式、循环条件、操作表达式，它们之间用“;”分割，{}中的执行语句为循环体。

        for(1.初始化表达式;2.循环条件;3.操作表达式)
        {
            //4.循环体
        }

    */

    $sum = 0;
    for($i=0;$i<=4;$i++)
    {
        $sum += $i;
    }
    echo $sum;

?>